Repository: ivknv/yadisk
Catalog: docs/locales/*/LC_MESSAGES/changelog.po
Languages: ru

source: Changelog
ru: История изменений

source: Fixed `issue #26`_: ':' character in filenames causes `BadRequestError`. This is due the behavior of Yandex.Disk's REST API itself but is avoided on the library level with this fix.
ru: Исправлено `issue #26`_: символ ':' в именах файлов приводит к `BadRequestError`. Это поведение вызвано работой самого REST API Яндекс.Диска, но было исправлено на уровне библиотеки.

source: Fixed a minor bug which could cause a `ReferenceError` (which would not cause a crash, but still show an error message). The bug involved using `__del__()` method in `SelfDestructingSession` to automatically close the sessions it seems to affect primarily old Python versions (such as 3.4).
ru: Исправлен баг, связанный с автоматическим закрытием сессии.Использование метода `__del__()` приводило в некоторых случаях к ошибке `ReferenceError` (ошибка игнорировалась, но сообщение выводилось).Баг проявляется по большей части в старых версиях Python (например 3.4).

source: Fixed a bug in `check_token()`: could throw `ForbiddenError` if the application lacks necessary permissions (`issue #23`_).
ru: Исправлен баг в `check_token()`: функция могла вызвать :code:`ForbiddenError`,если у приложения недостатчно прав (`issue #23`_).

source: Fixed an issue where `http://` links were not recognized as operation links (they were assumed to always be `https://`, since all the other requests are always HTTPS). Occasionally, Yandex.Disk can for some reason return an `http://` link to an asynchronous operation instead of `https://`. Both links are now recognized correctly and an `https://` version will always be used by `get_operation_status()`, regardless of which one Yandex.Disk returned.
ru: Исправлено: не распознавались ссылки на асинхронные операции, если они использовали `http://` (вместо `https://`). Иногда Яндекс.Диск может вернуть `http://` ссылку на асинхронную операцию. Теперь обе версии ссылок распознаются правильно, при этом, при получении информации об операции (через `get_operation_status()`) всегда используется `https://` версия ссылки, даже если Яндекс.Диск вернул `http://`.

source: Fixed a `TypeError` in `get_public_*` functions when passing `path` parameter (see `issue #7`_)
ru: Исправлена ошибка `TypeError` в функциях `get_public_*` при использовании с параметром `path` (`issue #7`_)

source: Added `unlimited_autoupload_enabled` attribute for `DiskInfoObject`
ru: Добавлен аттрибут `unlimited_autoupload_enabled` для `DiskInfoObject`

source: Added `md5` parameter for `remove()`
ru: Добавлен параметр `md5` для `remove()`

source: Added `UserPublicInfoObject`
ru: Добавлен `UserPublicInfoObject`

source: Added `country` attribute for `UserObject`
ru: Добавлен аттрибут `country` для `UserObject`

source: Added `photoslice_time` attribute for `ResourceObject`, `PublicResourceObject` and `TrashResourceObject`
ru: Добавлен аттрибут `photoslice_time` для `ResourceObject`, `PublicResourceObject` и `TrashResourceObject`

source: Fixed `fields` parameter not working properly in `listdir()` (`issue #4`_)
ru: Исправлен баг: не работает параметр `fields` в `listdir()` (`issue #4`_)

source: Added the missing parameter `sort` for `get_meta()`
ru: Добавлен недостающий параметр `sort` для `get_meta()`

source: Added `file` and `antivirus_status` attributes for `ResourceObject`, `PublicResourceObject` and `TrashResourceObject`
ru: Добавлены аттрибуты `file` и `antivirus_status` для `ResourceObject`, `PublicResourceObject` и `TrashResourceObject`

source: Added `headers` parameter
ru: Добавлен параметр `headers`

source: Fixed a typo in `download()` and `download_public()` (`issue #2`_)
ru: Исправлена опечатка в `download()` и `download_public()` (`issue #2`_)

source: Removed `*args` parameter everywhere
ru: Убран параметр `*args`

source: Fixed `timeout=None` behavior. `None` is supposed to mean 'no timeout' but in the older versions it was synonymous with the default timeout.
ru: Исправлено поведение `timeout=None`. `None` должен означать 'без таймаута', но в предыдущих версиях значение `None` было синонимично со стандартным таймаутом.

source: Changed the license to LGPLv3 (see `COPYING` and `COPYING.lesser`)
ru: Изменена лицензия на LGPLv3 (см. `COPYING` и `COPYING.lesser`)

source: Other package info updates
ru: Другие изменения информации о пакете

source: Fixed a couple of typos: `PublicResourceListObject.items` and `TrashResourceListObject.items` had wrong types
ru: Исправлено несколько опечаток: у `PublicResourceListObject.items` и `TrashResourceListObject.items` были неправильные типы данных

source: Substitute field aliases in `fields` parameter when performing API requests (e.g. `embedded` -> `_embedded`)
ru: Псевдонимы полей в параметре `fields` заменяются при выполнении запросов API (например, `embedded` -> `_embedded`)

source: Fixed a file rewinding bug when uploading/downloading files after a retry
ru: Исправлен баг перемотки файла при загрузке/скачивании после повторной попытки

source: Now caching `requests` sessions so that open connections can be reused (which can significantly speed things up sometimes)
ru: Теперь объекты сессий `requests` кэшируются, чтобы их можно было переиспользовать (иногда может существенно ускорить выполнение запросов)

source: Disable `keep-alive` when uploading/downloading files by default
ru: `keep-alive` отключается при загрузке/скачивании файлов по умолчанию

source: Fixed an off-by-one bug in `utils.auto_retry()` (which could sometimes result in `AttributeError`)
ru: Исправлен баг (ошибка на единицу) в `utils.auto_retry()` (иногда мог вызвать `AttributeError`)

source: Retry the whole request for `upload()`, `download()` and `download_public()`
ru: Повторные попытки применяются для `upload()`, `download()` и `download_public()` целиком

source: Set `stream=True` for `download()` and `download_public()`
ru: Задано `stream=True` для `download()` и `download_public()`

source: Other minor fixes
ru: Другие мелкие исправления

source: Fixed `TokenObject` having `exprires_in` instead of `expires_in` (fixed a typo)
ru: Исправлена опечатка (`TokenObject.exprires_in` -> `TokenObject.expires_in`)

source: Fixed a `TypeError` when `WrongResourceTypeError` is raised
ru: Исправлено `TypeError` при вызове `WrongResourceTypeError`

source: `refresh_token()` no longer requires a valid or empty token.
ru: `refresh_token()` больше не требует валидный или пустой токен.

source: Fixed auto retries not working. Whoops.
ru: Исправлена неработоспособность повторных попыток.

source: Fixed passing `n_retries=0` to `upload()`, `download()` and `download_public()`
ru: Исправлено использование `n_retries=0` в `upload()`, `download()` и `download_public()`

source: `upload()`, `download()` and `download_public()` no longer return anything (see the docs)
ru: `upload()`, `download()` и `download_public()` больше не возвращают ничего (см. документацию)

source: Added `utils` module (see the docs)
ru: Добавлен модуль `utils` (см. документацию)

source: Added `RetriableYaDiskError`, `WrongResourceTypeError`, `BadGatewayError` and `GatewayTimeoutError`
ru: Добавлены `RetriableYaDiskError`, `WrongResourceTypeError`, `BadGatewayError` и `GatewayTimeoutError`

source: `listdir()` now raises `WrongResourceTypeError` instead of `NotADirectoryError`
ru: `listdir()` теперь вызывает `WrongResourceTypeError` вместо `NotADirectoryError`

source: Fixed argument handling in `upload()`, `download()` and `download_public()`. Previously, passing `n_retries` and `retry_interval` would raise an exception (`TypeError`).
ru: Исправлена обработка аргументов в `upload()`, `download()` и `download_public()`. До этого использование `n_retries` и `retry_interval` вызывало исключение (`TypeError`).

source: Better exceptions (see the docs)
ru: Усовершенствованные исключения (см. документацию)

source: Added support for `force_async` parameter
ru: Добавлена поддержка параметра `force_async`

source: Minor bug fixes
ru: Мелкие исправления багов

source: Fixed yet another `listdir()` bug
ru: Исправлен ещё один баг в `listdir()`

source: Added `install_requires` argument to `setup.py`
ru: Добавлен `install_requires` в `setup.py`

source: Return `OperationLinkObject` in some functions
ru: Некоторые функции теперь возвращают `OperationLinkObject`

source: Fixed `setup.py` to exclude tests
ru: Исправлен `setup.py`, теперь исключает тесты

source: Fixed bugs in `upload`, `download` and `listdir` functions
ru: Исправлены баги в `upload`, `download` и `listdir`

source: Set default `listdir` `limit` to `10000`
ru: Значение по-умолчанию `limit` в `listdir` установлено в `10000`

source: Added settings
ru: Добавлен модуль `settings`

source: Fixed `get_code_url` function (added missing parameters)
ru: Исправлена функция `get_code_url` (добавлены недостающие параметры)

source: Fixed a major bug in `GetTokenRequest` (added missing parameter)
ru: Исправлен серьёзный баг в `GetTokenRequest` (добавлен недостающий параметр)

source: Initial release
ru: Первый релиз
