Repository: ivknv/yadisk
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: ru

source: Documentation
ru: Документация

source: Implements access to Yandex.Disk REST API.
ru: Реализует доступ к REST API Яндекс.Диска.

source: application ID
ru: идентификатор приложения

source: application secret password
ru: пароль приложения

source: application token
ru: токен

source: `str`, application ID
ru: `str`, идентификатор приложения

source: `str`, application secret password
ru: `str`, пароль приложения

source: `str`, application token
ru: `str`, токен

source: Check whether the token is valid.
ru: Проверяет, действителен ли токен.

source: token to check, equivalent to `self.token` if `None`
ru: токен, подлежащий проверке, то же самое, что `self.token` при `None`

source: Clears the session cache. Unused sessions will be closed.
ru: Очищает кэш сессий. Неиспользуемые сессии будут закрыты.

source: Copy `src_path` to `dst_path`. If the operation is performed asynchronously, returns the link to the operation, otherwise, returns the link to the newly created resource.
ru: Копирует `src_path` в `dst_path`. Если операция выполняется асинхронно, возвращает ссылку на операцию, иначе, возвращает ссылку на новый ресурс.

source: source path
ru: исходный путь

source: destination path
ru: путь назначения

source: if `True` the destination path can be overwritten, otherwise, an error will be raised
ru: если `True`, путь назначения может быть перезаписан, иначе будет вызвана ошибка

source: forces the operation to be executed asynchronously
ru: заставляет выполнять операцию асинхронно

source: list of keys to be included in the response
ru: список ключей, которые будут включены в ответ

source: :any:`LinkObject` or :any:`OperationLinkObject`
ru: :any:`LinkObject` или :any:`OperationLinkObject`

source: Download the file.
ru: Скачивает файл.

source: destination path or file-like object
ru: путь назначения или файл-подобный объект

source: Download the public resource.
ru: Скачивает публичный ресурс.

source: public key or public URL of the resource
ru: публичный ключ или URL к ресурсу

source: Check whether `path` exists.
ru: Проверяет, существует ли `path`.

source: path to the resource
ru: путь к ресурсу

source: Get authentication URL for the user to go to.
ru: Получает URL для аутентификации для пользователя.

source: response type ("code" to get the confirmation code or "token" to get the token automatically)
ru: тип ответа ("code", чтобы получить код подтверждения или "token", чтобы получить токен автоматически)

source: unique device ID, must be between 6 and 50 characters
ru: уникальный идентификатор устройства, от 6 до 50 символов

source: device name, should not be longer than 100 characters
ru: имя устройства, не более 100 символов

source: indicates whether to use lightweight layout, values other than "popup" are ignored
ru: указывает использовать облегчённую вёрстку, обрабатывает только "popup", остальные значения игнорируются

source: username or email for the account the token is being requested for
ru: username или email аккаунта, для которого будет получен токен

source: list of permissions for the application
ru: список разрешений для приложения

source: list of optional permissions for the application
ru: список опциональных разрешений для приложения

source: if True, user will be required to confirm access to the account even if the user has already granted access for the application
ru: Если `True`, пользователь должен будет разрешить доступ к аккаунту, даже если он уже это сделал до этого

source: The state string, which Yandex.OAuth returns without any changes (<= 1024 characters)
ru: Строка состояния, которую Яндекс.OAuth возвращает без изменений (<= 1024 символов)

source: authentication URL
ru: URL для аутентификации

source: Get the URL for the user to get the confirmation code. The confirmation code can later be used to get the token.
ru: Получает URL для получения пользователем кода подтверждения. Он может быть использован для получения токена.

source: Get disk information.
ru: Получает информацию о диске.

source: Get a download link for a file (or a directory).
ru: Получает ссылку на скачивание файла (или папки).

source: Get a flat list of all files (that doesn't include directories).
ru: Получить плоский список всех файлов (без папок).

source: offset from the beginning of the list
ru: отступ от начала списка

source: number of list elements to be included
ru: максимальное количество элементов списка

source: type of files to include in the list
ru: тип файлов, которые будут включены в список

source: sort type
ru: тип сортировки

source: generator of :any:`ResourceObject`
ru: генератор :any:`ResourceObject`

source: Get the list of latest uploaded files sorted by upload date.
ru: Получает список последних загруженных файлов, отсортированный по дате загрузки.

source: maximum number of elements in the list
ru: максимальное число элементов в списке

source: size of the file preview
ru: размер превью файла

source: `bool`, cut the preview to the size specified in the `preview_size`
ru: `bool`, обрезает превью согласно размеру, заданному в `preview_size`

source: generator of :any:`LastUploadedResourceListObject`
ru: генератор :any:`LastUploadedResourceListObject`

source: Get meta information about a file/directory.
ru: Получает мета-информацию о ресурсе.

source: number of children resources to be included in the response
ru: количество ресурсов в папке, которые будут включены в ответ

source: number of children resources to be skipped in the response
ru: количество ресурсов в папке, которые будут пропущены

source: Get operation status.
ru: Получает статус операции.

source: ID of the operation or a link
ru: идентификатор операции или ссылка на нее

source: Get a download link for a public resource.
ru: Получает ссылку на скачивание публичного ресурса.

source: Get meta-information about a public resource.
ru: Получает мета-информацию о публичном ресурсе.

source: offset from the beginning of the list of nested resources
ru: отступ от начала списка вложенных ресурсов

source: maximum number of nested elements to be included in the list
ru: максимальное количество элементов списка вложенных ресурсов

source: key to sort by
ru: ключ по которму сортировать

source: file preview size
ru: размер превью файла

source: `bool`, allow preview crop
ru: `bool`, разрешить обрезку превью

source: Get a list of public resources.
ru: Получает список публичных ресурсов.

source: filter based on type of resources ("file" or "dir")
ru: фильтр по типу ресурса ("file" или "dir")

source: Get public resource type.
ru: Получает тип публичного ресурса.

source: "file" or "dir"
ru: "file" или "dir"

source: Like :any:`YaDisk.make_session` but wrapped in :any:`functools.lru_cache`.
ru: То же, что и :any:`YaDisk.make_session`, но с обёрткой :any:`functools.lru_cache`.

source: :any:`requests.Session`, different instances for different threads
ru: :any:`requests.Session`, отдельные объекты для разных потоков

source: Get a new token.
ru: Получает новый токен.

source: confirmation code
ru: код подтверждения

source: unique device ID (between 6 and 50 characters)
ru: уникальный идентификатор устройства (между 6 и 50 символами)

source: Get meta information about a trash resource.
ru: Получает мета-информацию о ресурсе корзины.

source: path to the trash resource
ru: путь к ресурсу корзины

source: Get trash resource type.
ru: Получает тип ресурса корзины.

source: Get resource type.
ru: Получает тип ресурса

source: Get a link to upload the file using the PUT request.
ru: Получает ссылку для загрузки файла на диск при помощи PUT запроса.

source: `bool`, determines whether to overwrite the destination
ru: `bool`, определяет, перезаписывать путь назначения или нет

source: Check whether `path` is a directory.
ru: Проверяет, является ли `path` папкой.

source: `True` if `path` is a directory, `False` otherwise (even if it doesn't exist)
ru: `True`, если `path` является папкой, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `path` is a file.
ru: Проверяет, является ли `path` файлом.

source: `True` if `path` is a file, `False` otherwise (even if it doesn't exist)
ru: `True`, если `path` является файлом, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `public_key` is a public directory.
ru: Проверяет, является ли `public_key` публичной папкой.

source: `True` if `public_key` is a directory, `False` otherwise (even if it doesn't exist)
ru: `True`, если `public_key` является папкой, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `public_key` is a public file.
ru: Проверяет, является ли `public_key` публичным файлом.

source: `True` if `public_key` is a file, `False` otherwise (even if it doesn't exist)
ru: `True`, если `public_key` является файлом, `False`, в остальных случаях (даже если ресурс не существует)

source: Check whether `path` is a trash directory.
ru: Проверяет, является ли `path` папкой в корзине.

source: Check whether `path` is a trash file.
ru: Проверяет, является ли `path` файлом в корзине.

source: Get contents of `path`.
ru: Получает содержимое `path`.

source: path to the directory
ru: путь к папке

source: Prepares :any:`requests.Session` object with headers needed for API.
ru: Готовит объект :any:`requests.Session` с заголовками, необходимыми для API.

source: application token, equivalent to `self.token` if `None`
ru: токен, то же самое, что `self.token`, если `None`

source: Create a new directory.
ru: Создаёт новую папку.

source: path to the directory to be created
ru: путь к папке, подлежащей созданию

source: Move `src_path` to `dst_path`.
ru: Перемещает `src_path` в `dst_path`.

source: source path to be moved
ru: исходный путь, подлежащий перемещению

source: :any:`OperationLinkObject` or :any:`LinkObject`
ru: :any:`OperationLinkObject` или :any:`LinkObject`

source: Update custom properties of a resource.
ru: Обновляет пользовательские свойства ресурса.

source: `dict`, custom properties to update
ru: `dict`, новые пользовательские свойства ресурса

source: Check whether the public resource exists.
ru: Проверяет, существует ли публичный ресурс.

source: Get contents of a public directory.
ru: Получает содержимое публичной папки.

source: generator of :any:`PublicResourceObject`
ru: генератор :any:`PublicResourceObject`

source: Make a resource public.
ru: Делает ресурс публичным.

source: path to the resource to be published
ru: путь к публикуемому ресурсу

source: :any:`LinkObject`, link to the resource
ru: :any:`LinkObject`, ссылка на ресурс

source: Refresh an existing token.
ru: Обновляет существующий токен.

source: the refresh token that was received with the token
ru: refresh-токен, полученный вместе с токеном

source: Remove the resource.
ru: Удаляет ресурс.

source: path to the resource to be removed
ru: путь к удаляемому ресурсу

source: if `True`, the resource will be removed permanently, otherwise, it will be just moved to the trash
ru: если `True`, ресурс будет безвозвратно удалён, иначе ресурс будет перемещён в корзину

source: :any:`OperationLinkObject` if the operation is performed asynchronously, `None` otherwise
ru: :any:`OperationLinkObject`, если операция выполняется асинхронно, иначе `None`

source: Remove a trash resource.
ru: Удаляет ресурс корзины.

source: path to the trash resource to be deleted
ru: путь к ресурсу корзины, подлежащий удалению

source: Restore a trash resource. Returns a link to the newly created resource or a link to the asynchronous operation.
ru: Восстанавливает ресурс корзины. Возвращает ссылку на новый ресурс или ссылку на асинхронную операцию.

source: path to the trash resource to restore
ru: путь к ресурсу корзины, подлежащий удалению

source: `bool`, determines whether the destination can be overwritten
ru: `bool`, определяет может ли путь назначения быть перезаписан

source: Revoke the token.
ru: Отзывает токен.

source: token to revoke, equivalent to `self.token` if `None`
ru: токен, подлежащий отзыву, то же самое, что `self.token`, если `None`

source: Saves a public resource to the disk. Returns the link to the operation if it's performed asynchronously, or a link to the resource otherwise.
ru: Сохраняет публичный ресурс на диск. Возвращает ссылку на операцию, если сохранение выполняется асинхронно, или возвращает ссылку на ресурс.

source: filename of the saved resource
ru: имя файла/папки, под которым будет сохранён ресурс

source: path to the destination directory (downloads directory by default)
ru: путь к папке назначения (загрузки по умолчанию)

source: Check whether the trash resource at `path` exists.
ru: Проверяет, существует ли `path` в корзине.

source: Get contents of a trash resource.
ru: Получает содержимое папки в корзине.

source: path to the directory in the trash bin
ru: путь к папке в корзине

source: generator of :any:`TrashResourceObject`
ru: генератор :any:`TrashResourceObject`

source: Make a public resource private.
ru: Делает публичный ресурс приватным.

source: path to the resource to be unpublished
ru: путь к ресурсу, подлежащему депубликации

source: Upload a file to disk.
ru: Загружает файл на диск.

source: path or file-like object to be uploaded
ru: путь к файлу или файл-подобный объект для загрузки

source: if `True`, the resource will be overwritten if it already exists, an error will be raised otherwise
ru: если `True`, путь назначения может быть перезаписан, иначе будет вызвана ошибка

source: Upload a file from URL.
ru: Загружает файл на диск по URL.

source: source URL
ru: исходный URL

source: `bool`, forbid redirects
ru: `bool`, запретить делать перенаправления

source: :any:`OperationLinkObject`, link to the asynchronous operation
ru: :any:`OperationLinkObject`, ссылка на асинхронную операцию

source: General parameters
ru: Общие параметры

source: Almost all methods of `YaDisk` (the ones that accept `*args` and `**kwargs`) accept some additional arguments:
ru: Почти все методы `YaDisk` (те, которые принимают `*args` и `**kwargs`) принимают некоторые дополнительные параметры:

source: **n_retries** - `int`, maximum number of retries for a request
ru: **n_retries** - `int`, максимальное число повторных попыток запроса

source: **retry_delay** - `float`, delay between retries (in seconds)
ru: **retry_delay** - `float`, задержка между повторными попытками (в секундах)

source: `requests` parameters like `timeout`, `proxies`, etc. are also accepted (see `requests.request()`).
ru: Параметры `requests`, такие как `timeout`, `proxies` и подобные так же принимаются (см. `requests.request()`).

source: This also applies to low-level functions and API request objects as well.
ru: Это так же применяется для низкоуровневых функций и объектов запросов API.

source: Settings
ru: Настройки

source: The following settings can be accessed and changed at runtime in `yadisk.settings` module:
ru: Следующие настройки в модуле `yadisk.settings` могут быть получены и изменены:

source: **DEFAULT_TIMEOUT** - `tuple` of 2 numbers (`int` or float`), default timeout for requests. First number is the connect timeout, the second one is the read timeout.
ru: **DEFAULT_TIMEOUT** - `tuple` из 2-х чисел (`int` или `float`), стандартный таймаут для запросов. Первое число - это таймаут соединения, второе - таймаут чтения.

source: **DEFAULT_N_RETRIES** - `int`, default number of retries
ru: **DEFAULT_N_RETRIES** - `int`, максимальное число повторных попыток запроса по умолчанию

source: **DEFAULT_RETRY_INTERVAL** - `float`, default retry interval
ru: **DEFAULT_RETRY_DELAY** - `float`, стандартная задержка между повторными попытками

source: **DEFAULT_UPLOAD_TIMEOUT** - analogous to `DEFAULT_TIMEOUT` but for `upload` function
ru: **DEFAULT_UPLOAD_TIMEOUT** - аналогично `DEFAULT_TIMEOUT`, но для функции `upload`

source: **DEFAULT_UPLOAD_RETRY_INTERVAL** - analogous to `DEFAULT_RETRY_INTERVAL` but for `upload` function
ru: **DEFAULT_UPLOAD_RETRY_INTERVAL** - аналогично `DEFAULT_RETRY_INTERVAL`, но для функции `upload`

source: Exceptions
ru: Исключения

source: Aside from the exceptions listed below, API requests can also raise exceptions in `requests`.
ru: Кроме исключений, перечисленных ниже, запросы к API могут также вызвать исключения `requests`.

source: Base class for all exceptions in this library.
ru: Базовый класс для всех исключений в этой библиотеке.

source: `str`, unique error code as returned by API
ru: `str`, уникальный код ошибки, полученный от API

source: an instance of :any:`requests.Response`
ru: объект :any:`requests.Response`

source: `str`, exception message
ru: `str`, сообщение исключения

source: Thrown when there was an error but it would make sense to retry the request.
ru: Вызывается в случае, если произошла ошибка, но имеет смысл повторить запрос.

source: Thrown when the request failed but the response does not contain any error info.
ru: Вызывается, когда запрос не удался, но не содержит информации об ошибке.

source: Thrown when the resource was expected to be of different type (e.g., file instead of directory).
ru: Вызывается, когда ожидался ресурс другого типа (например, файл вместо папки).

source: Thrown when the server returns code 400.
ru: Вызывается, когда сервер вернул код 400.

source: Thrown when the server returns code 401.
ru: Вызывается, когда сервер вернул код 401.

source: Thrown when the server returns code 403.
ru: Вызывается, когда сервер вернул код 403.

source: Thrown when the server returns code 404.
ru: Вызывается, когда сервер вернул код 404.

source: Thrown when the server returns code 406.
ru: Вызывается, когда сервер вернул код 406.

source: Thrown when the server returns code 409.
ru: Вызывается, когда сервер вернул код 409.

source: Thrown when the server returns code 415.
ru: Вызывается, когда сервер вернул код 415.

source: Thrown when the server returns code 423.
ru: Вызывается, когда сервер вернул код 423.

source: Thrown when the server returns code 429.
ru: Вызывается, когда сервер вернул код 429.

source: Thrown when the server returns code 500.
ru: Вызывается, когда сервер вернул код 500.

source: Thrown when the server returns code 502
ru: Вызывается, когда сервер вернул код 502.

source: Thrown when the server returns code 503.
ru: Вызывается, когда сервер вернул код 503.

source: Thrown when the server returns code 504
ru: Вызывается, когда сервер вернул код 504.

source: Thrown when the server returns code 509.
ru: Вызывается, когда сервер вернул код 509.

source: Thrown when the requested path does not exist.
ru: Вызывается, когда запрашиваемый путь не существует.

source: Thrown by `mkdir`, `upload`, etc. when the parent directory doesn't exist.
ru: Вызывается `mkdir`, `upload` и т.д. когда родительская папка не существует.

source: Thrown when the requested path already exists.
ru: Вызывается, когда запрашиваемый путь уже существует.

source: Thrown when the directory already exists.
ru: Вызывается, когда папка уже существует.

source: Thrown when the request contains fields with invalid data.
ru: Вызывается, когда запрос содежит поля с некорректными данными.

source: Thrown when the resource is locked by another operation.
ru: Вызывается, когда запрашиваемый ресурс заблокирован другой операцией.

source: Objects
ru: Объекты

source: Base class for all objects mirroring the ones returned by Yandex.Disk REST API. It must have a fixed number of fields, each field must have a type. It also supports subscripting and access of fields through the . operator.
ru: Базовый класс для всех объектов, реализующий объекты, возвращаемые REST API Яндекс.Диска. У наследующего объекта фиксированное количество полей, каждое со своим типом. Поддерживает доступ по индексу и через точку.

source: `dict` or `None`
ru: `dict` или `None`

source: Set all the fields of the object to the values in `source_dict`. All the other fields are ignored
ru: Задаёт значения всех полей объекта из `source_dict`. Все остальные ключи игнорируются.

source: `dict` or `None` (nothing will be done in that case)
ru: `dict` или `None` (тогда ничего не будет сделано)

source: Remove an alias.
ru: Удаляет псевдоним.

source: Remove field.
ru: Удаляет поле.

source: Set an alias.
ru: Задаёт псевдоним.

source: `str`, alias to add
ru: `str`, псевдоним

source: `str`, field name
ru: `str`, имя поля

source: Set field type.
ru: Задаёт тип поля.

source: type or factory
ru: тип данных или factory

source: Set the field types of the object
ru: Задаёт типы полей объекта

source: `dict`, where keys are the field names and values are types (or factories)
ru: `dict`, где ключи - это наименования полей, а значения - это типы

source: Mirrors Yandex.Disk REST API error object.
ru: Реализует объект ошибки REST API Яндекс.Диска.

source: `str`, human-readable error message
ru: `str`, человеко-читаемое сообщение ошибки

source: `str`, technical error description
ru: `str`, техническое описание ошибки

source: `str`, error code
ru: `str`, уникальный код ошибки

source: Token object.
ru: Объект токена.

source: `str`, token string
ru: `str`, строка токена

source: `str`, the refresh-token
ru: `str`, refresh-токен

source: `str`, type of the token
ru: `str`, тип токена

source: `int`, amount of time before the token expires
ru: `int`, количество времени, на которое выдаётся токен

source: Result of token revocation request.
ru: Результат запроса по отзыву токена.

source: `str`, status of the operation
ru: `str`, статус операции

source: Disk information object.
ru: Объект информации о диске.

source: `int`, maximum supported file size (bytes)
ru: `int`, максимальный поддерживаемый размер файла (в байтах)

source: `int`, total disk size (bytes)
ru: `int`, общий размер диска (в байтах)

source: `int`, amount of space used by trash (bytes), part of `used_space`
ru: `int`, размер, занятый мусором (в байтах), чась `used_space`

source: `bool`, tells if the account is paid or not
ru: `bool`, признак платного аккаунта

source: `int`, amount of space used (bytes)
ru: `int`, количество занятого места (в байтах)

source: :any:`SystemFoldersObject`, paths to the system folders
ru: :any:`SystemFoldersObject`, пути к системным папкам

source: :any:`UserObject`, owner of the disk
ru: :any:`UserObject`, владелец диска

source: `int`, current revision of Yandex.Disk
ru: `int`, текущая ревизия Яндекс.Диска

source: Object, containing paths to system folders.
ru: Объект, содержащий пути к системным папкам.

source: `str`, path to the Odnoklassniki folder
ru: `str`, путь к папке Одноклассников

source: `str`, path to the Google+ folder
ru: `str`, путь к папке Google+

source: `str`, path to the Instagram folder
ru: `str`, путь к папке Instagram

source: `str`, path to the VKontakte folder
ru: `str`, путь к папке ВКонтакте

source: `str`, path to the My World folder
ru: `str`, путь к папке Моего Мира

source: `str`, path to the Facebook folder
ru: `str`, путь к папке Facebook

source: `str`, path to the social networks folder
ru: `str`, путь к папке социальных сетей

source: `str`, path to the screenshot folder
ru: `str`, путь к папке скриншотов

source: `str`, path to the camera folder
ru: `str`, путь к папке фотокамеры

source: User object.
ru: Объект пользователя.

source: `str`, user's login
ru: `str`, логин пользователя

source: `str`, user's display name
ru: `str`, отображаемое имя пользователя

source: `str`, user's UID
ru: `str`, уникальный идентификатор пользователя

source: Comment IDs object.
ru: Список идентификаторов комментариев.

source: `str`, comment ID for private resources
ru: `str`, идентификатор комментария для приватных ресурсов

source: `str`, comment ID for public resources
ru: `str`, идентификатор комментария для публичных ресурсов

source: EXIF metadata object.
ru: Объект метаданных EXIF.

source: :any:`datetime.datetime`, capture date
ru: :any:`datetime.datetime`, дата съёмки
