Repository: ivknv/yadisk
Catalog: docs/locales/*/LC_MESSAGES/docs.po
Languages: ru

source: Flat list of files.
ru: Плоский список файлов.

source: `list`, flat list of files (:any:`ResourceObject`)
ru: `list`, плоский список файлов (:any:`ResourceObject`)

source: `int`, maximum number of elements in the list
ru: `int`, максимальное число элементов в списке

source: `int`, offset from the beginning of the list
ru: `int`, отступ от начала списка

source: List of last uploaded resources.
ru: Список последних загруженных файлов.

source: `list`, list of resources (:any:`ResourceObject`)
ru: `list`, список ресурсов (:any:`ResourceObject`)

source: Link object.
ru: Объект ссылки.

source: `str`, link URL
ru: `str`, URL ссылки

source: `str`, HTTP method
ru: `str`, HTTP метод

source: `bool`, tells whether the URL is templated
ru: `bool`, признак шаблонизированного URL

source: Operation link object.
ru: Объект ссылки на операцию.

source: List of public resources.
ru: Список публичных ресурсов.

source: `list`, list of public resources (:any:`PublicResourceObject`)
ru: `list`, список публичных ресурсов (:any:`PublicResourceObject`)

source: `str`, resource type to filter by
ru: `str`, тип ресурса по которому фильтровать

source: List of resources.
ru: Список ресурсов.

source: `str`, sort type
ru: `str`, тип сортировки

source: `str`, path to the directory that contains the elements of the list
ru: `str`, путь к папке, содержащей элементы списка

source: `int`, number of elements in the list
ru: `int`, количество элементов списка

source: Resource object.
ru: Объект ресурса.

source: `int`, file size
ru: `int`, размер файла

source: `str`, public resource key
ru: `str`, публичный ключ

source: `str`, SHA256 hash
ru: `str`, SHA256 хэш

source: `str`, MD5 hash
ru: `str`, MD5 хэш

source: :any:`ResourceListObject`, list of nested resources
ru: :any:`ResourceListObject`, список вложенных ресурсов

source: `str`, filename
ru: `str`, имя файла

source: :any:`EXIFObject`, EXIF metadata
ru: :any:`EXIFObject`, метаданные EXIF

source: `str`, resource ID
ru: `str`, идентификатор ресурса

source: `dict`, custom resource properties
ru: `dict`, пользовательские свойства ресурса

source: `str`, public URL
ru: `str`, публичный URL

source: :any:`ShareInfoObject`, shared folder information
ru: :any:`ShareInfoObject`, информация об общей папке

source: :any:`datetime.datetime`, date of last modification
ru: :any:`datetime.datetime`, дата последнего изменения

source: :any:`datetime.datetime`, date of creation
ru: :any:`datetime.datetime`, дата создания

source: `str`, MIME type
ru: `str`, MIME-тип

source: `str`, path to the resource
ru: `str`, путь к ресурсу

source: `str`, file preview URL
ru: `str`, URL превью файла

source: :any:`CommentIDsObject`, comment IDs
ru: :any:`CommentIDsObject`, идентификаторы комментариев

source: `str`, type ("file" or "dir")
ru: `str`, тип ("file" или "dir")

source: `str`, file type as determined by Yandex.Disk
ru: `str`, тип файла, согласно Яндекс.Диску

source: `int`, Yandex.Disk revision at the time of last modification
ru: `int`, ревизия Яндекс.Диска на момент последнего изменения

source: Resource upload link.
ru: Ссылка для загрузки файла.

source: `str`, ID of the upload operation
ru: `str`, идентификатор операции по загрузке файла

source: Shared folder information object.
ru: Объект информации об общей папке.

source: `bool`, tells whether the folder is root
ru: `bool`, признак того, что папка является корневой

source: `bool`, tells whether the user is the owner of this directory
ru: `bool`, признак того, что пользователь является владельцем этой папки

source: `str`, access rights
ru: `str`, права доступа

source: Public resource object.
ru: Объект публичного ресурса.

source: :any:`PublicResourceObject`, list of nested resources
ru: :any:`PublicResourceObject`, список вложенных ресурсов

source: `int`, number of times the public resource was viewed
ru: `int`, количество просмотров публичного ресурса

source: :any:`UserObject`, owner of the public resource
ru: :any:`UserObject`, владелец публичного ресурса

source: `str`, public key of the resource
ru: `str`, публичный ключ к ресурсу

source: Trash resource object.
ru: Объект ресурса корзины.

source: :any:`TrashResourceListObject`, list of nested resources
ru: :any:`ResourceListObject`, список вложенных ресурсов

source: `str`, original path
ru: `str`, оригинальный путь

source: :any:`datetime.datetime`, date of deletion
ru: :any:`datetime.datetime`, дата удаления

source: List of trash resources.
ru: Список ресурсов корзины.

source: `list`, list of resources (:any:`TrashResourceObject`)
ru: `list`, список ресурсов (:any:`TrashResourceObject`)

source: Operation status object.
ru: Объект статуса операции.

source: `str`, type of the operation
ru: `str`, тип операции

source: `str`, ID of the operation
ru: `str`, идентификатор операции

source: :any:`LinkObject`, link to the operation
ru: :any:`LinkObject`, ссылка на операцию

source: `dict`, other information about the operation
ru: `dict`, другая информация об операции

source: Low-level API
ru: Низкоуровневый API

source: Utilities
ru: Вспомогательные средства

source: Get an exception instance based on response, assuming the request has failed.
ru: Возвращает объект исключения, основываясь на ответе (подразумевается, что запрос не удался).

source: an exception instance, subclass of :any:`YaDiskError`
ru: Объект исключения, подкласс :any:`YaDiskError`

source: Attempt to perform a request with automatic retries. A retry is triggered by :any:`requests.exceptions.RequestException` or :any:`RetriableYaDiskError`.
ru: Выполняет запрос с автоматическими повторными попытками. Повторная попытка может быть вызвана :any:`requests.RequestException` или :any:`RetriableYaDiskError`.

source: function to run, must not require any arguments
ru: Функция, подлежащая исполнению, не должна требовать аргументов

source: `int`, maximum number of retries
ru: `int`, максимальное число повторных попыток запроса

source: `int` or `float`, delay between retries (in seconds)
ru: `int` или `float`, задержка между повторными попытками в секундах

source: return value of func()
ru: Значение, возвращаемое func()

source: Functions
ru: Функции

source: an instance of :any:`requests.Session` with prepared headers
ru: объект :any:`requests.Session` с приготовленными заголовками

source: token to revoke
ru: токен, подлежащий отзыву

source: :any:`LinkObject` if the operation is performed asynchronously, `None` otherwise
ru: :any:`LinkObject`, если операция выполняется асинхронно, иначе `None`

source: path to the trash resource to be restored
ru: путь к восстанавливаему ресурсу

source: API request objects
ru: Объекты запросов к API

source: Base class for all API requests.
ru: Базовый класс для всех объектов запросов к REST API.

source: an instance of :any:`requests.Session`
ru: объект :any:`requests.Session`

source: `dict` of arguments, that will be passed to `process_args`
ru: `dict`, аргументы, которые будут перданы в `process_args`

source: request timeout
ru: таймаут запроса

source: additional request headers
ru: дополнительные заголовки запроса

source: maximum number of retries
ru: максимальное число повторных попыток запроса

source: delay between retries in seconds
ru: задержка между повторными попытками в секундах

source: other parameters for session.send()
ru: другие параметры для session.send()

source: `str`, request URL
ru: `str`, URL запроса

source: `str`, request method
ru: `str`, метод запроса

source: `str`, Content-Type header ("application/x-www-form-urlencoded" by default)
ru: `str`, заголовок Content-Type ("application/x-www-form-urlencoded" по умолчанию)

source: `float` or `tuple`, request timeout
ru: `float` или `tuple`, таймаут запроса

source: `list`-like, list of response codes that indicate request's success
ru: `list`-подобный, список кодов ответов, означающих успех запроса

source: `float`, delay between retries in seconds
ru: `float`, задержка между повторными попытками в секундах

source: Prepare the request
ru: Готовит запрос

source: Process the response.
ru: Обрабатывает ответ.

source: depends on `self.process_json()`
ru: зависит от `self.process_json()`

source: Process the JSON response.
ru: Обрабатывает JSON ответ.

source: `dict`, JSON response
ru: `dict`, JSON ответ

source: processed response, can be anything
ru: обработанный ответ, может быть что угодно

source: Actually send the request
ru: Отправляет запрос

source: A request to refresh an existing token.
ru: Запрос для обновления существующего токена.

source: the refresh token that was received with the original token
ru: refresh-токен, полученный вместе с токеном

source: A request to revoke the token.
ru: Запрос для отзыва токена.

source: the token to be revoked
ru: токен, подлежащий отзыву

source: A request to get the token.
ru: Запрос для получения токена.

source: A request to get disk information.
ru: Запрос для получения информации о диске.

source: A request to get a list of public resources.
ru: Запрос для получения списка публичных ресурсов.

source: A request to make a public resource private.
ru: Запрос для того, чтобы сделать публичный ресурс приватным.

source: A request to get a download link to a resource.
ru: Запрос для получения ссылки на скачивание ресурса.

source: path to the resource to be downloaded
ru: путь к скачиваемому ресурсу

source: A request to get meta-information about a trash resource.
ru: Запрос для получния мета-информации о ресурсе корзины.

source: A request to restore trash.
ru: Запрос для восстановления мусора.

source: A request to delete a trash resource.
ru: Запрос для удаления ресурса корзины.

source: :any:`OperationLinkObject` or `None`
ru: :any:`OperationLinkObject` или `None`

source: A request to get the list of latest uploaded files sorted by upload date.
ru: Запрос для получения списка последних загруженных файлов, отсортированного по дате загрузки.

source: A request to copy a file or a directory.
ru: Запрос копирования файла или папки.

source: A request to get meta-information about a resource.
ru: Запрос для получния мета-информации о ресурсе.

source: A request to get an upload link.
ru: Запрос для получения ссылки для загрузки ресурса.

source: path to be uploaded at
ru: путь назначения для загрузки файла

source: A request to create a new directory.
ru: Запрос для создания новой папки.

source: A request to make a resource public.
ru: Запрос для того, чтобы сделать ресурс публичным.

source: A request to upload a file from URL.
ru: Запрос для загрузки файла по URL.

source: A request to delete a file or a directory.
ru: Запрос для удаления ресурса.

source: A request to save a public resource to the disk.
ru: Запрос для сохранения публичного ресурса на диск.

source: A request to get meta-information about a public resource.
ru: Запрос для получния мета-информации о публичном ресурсе.

source: A request to get a download link for a public resource.
ru: Запрос для получения ссылки на скачивание публичного ресурса.

source: A request to move a resource.
ru: Запрос для перемещения ресурса.

source: A request to get a flat list of all files (that doesn't include directories).
ru: Запрос для получения плоского списка всех файлов.

source: A request to update custom properties of a resource.
ru: Запрос для обновления пользовательских свойств ресурса.

source: A request to get operation status.
ru: Запрос для получения статуса операции.

source: operation ID or link
ru: идентификатор операции или ссылка на нее
